uhnp/src/AccumulationRegisters/ПодтвержденныеОбъемыЗакупок/ПодтвержденныеОбъемыЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПодтвержденныеОбъемыЗакупок</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Подтверждено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Запланировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодтвержденоСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/АналитикаКонтроляОбъемаЗакупок/АналитикаКонтроляОбъемаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаКонтроляОбъемаЗакупок</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РежимыКонтроляДокументов/РежимыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДокументов</name>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
  <enumValues>
    <name>Информировать</name>
  </enumValues>
  <enumValues>
    <name>НеКонтролировать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/КлючиКонтроляОбъемаЗакупок/КлючиКонтроляОбъемаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиКонтроляОбъемаЗакупок</name>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/ChartsOfCharacteristicTypes/ВидыКонтроляДокументов/ВидыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыКонтроляДокументов</name>
  <type>
    <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
    <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
    <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
    <types>CatalogRef.КлючиАналитикиПланированияРасчетовСКонтрагентами</types>
    <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
  </type>
  <predefined>
    <items>
      <name>КонтрольБюджетныхЛимитов</name>
      <description>Контроль бюджетных лимитов</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольБюджетныхРезервов</name>
      <description>Контроль бюджетных резервов</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольМаксимальнойСуммыЗадолженностиПоДоговору</name>
      <description>Контроль задолженности по договору</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбщейЗадолженностиКонтрагента</name>
      <description>Контроль задолженности по контрагенту</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбъемаЗакупок</name>
      <description>Контроль подтвержденного объема закупок</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
      </type>
    </items>
    <items>
      <name>КонтрольРасходовПоДоговору</name>
      <description>Контроль расходов по договору</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РежимКонтроля</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/КонтрольУХОбъемыЗакупок/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает объект-проверку
Функция Создать() Экспорт
	
	Проверка = КонтрольУХ.Новый_Проверка();
	Проверка.Объект 		= КонтрольУХОбъемыЗакупок;
	Проверка.Источник 		= ИмяИсточника();
	Проверка.ВидКонтроля 	= ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольОбъемаЗакупок;
	//Проверка.ИмяРеквизита 	= "ЕстьПревышениеЛимитыВзаиморасчеты";
	
	Возврат Проверка;
	
КонецФункции 

// Возвращает имя источника для проверки
//
Функция ИмяИсточника() Экспорт
	
	Возврат "КонтрольУХОбъемыЗакупок";
	
КонецФункции

// Функция возвращает Истина, если для этого документа проверка выполняется
Функция ТребуетсяДляДокумента(ИмяДокумента) Экспорт
	
	Возврат ИмяДокумента = "ЗаказПоставщику";	
КонецФункции

// Функция возвращает Истина, если требуется выполнение проверки исходя из данных источника
Функция ТребуетсяПроверка(ПараметрыКонтроля, Источник) Экспорт
	
	Если ТипЗнч(Источник) <> Тип("Структура") ИЛИ НЕ Источник.Свойство("ДанныеНоменклатура") Тогда
		Возврат Ложь;
	КонецЕсли;  
			
	Возврат Источник.ДанныеНоменклатура.Количество() > 0;
	
КонецФункции

// Функция выполняет обработку данных источника
Функция ОбработатьДанныеИсточника(ИнформацияДляКонтроля, Источник) Экспорт
	
	//
	Запрос = Новый Запрос;
	Для Каждого КлючЗначение Из Источник Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеНоменклатура.Номенклатура КАК Номенклатура,
	|	ДанныеНоменклатура.ЦФО КАК ЦФО,
	|	ДанныеНоменклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ДанныеНоменклатура.Периодичность КАК Периодичность,
	|	ДанныеНоменклатура.Период КАК Период,
	|	ДанныеНоменклатура.Количество КАК Количество,
	|	ДанныеНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеНоменклатура.Коэффициент КАК Коэффициент,
	|	ДанныеНоменклатура.ДатаПоставки КАК ДатаПоставки
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&ДанныеНоменклатура КАК ДанныеНоменклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.Периодичность КАК Периодичность,
	|	ВТТовары.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТовары.Номенклатура,
	|	ВТТовары.Периодичность,
	|	ВТТовары.ЦФО
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтвержденныеОбъемыЗакупокОбороты.ЦФО КАК ЦФО,
	|	ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура КАК Номенклатура,
	|	ПодтвержденныеОбъемыЗакупокОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВТТовары.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА ПодтвержденныеОбъемыЗакупокОбороты.ПериодКвартал
	|		КОГДА ВТТовары.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА ПодтвержденныеОбъемыЗакупокОбороты.ПериодГод
	|		ИНАЧЕ ПодтвержденныеОбъемыЗакупокОбороты.ПериодМесяц
	|	КОНЕЦ КАК Период,
	|	СУММА(ПодтвержденныеОбъемыЗакупокОбороты.ПодтвержденоОборот) КАК Подтверждено,
	|	СУММА(ПодтвержденныеОбъемыЗакупокОбороты.ЗапланированоОборот) КАК Запланировано,
	|	ВТТовары.Периодичность КАК Периодичность
	|ПОМЕСТИТЬ ВТОбороты
	|ИЗ
	|	РегистрНакопления.ПодтвержденныеОбъемыЗакупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			(Номенклатура, ЦФО) В
	|				(ВЫБРАТЬ
	|					ВТТовары.Номенклатура,
	|					ВТТовары.ЦФО
	|				ИЗ
	|					ВТТовары)) КАК ПодтвержденныеОбъемыЗакупокОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТТовары
	|		ПО ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура = ВТТовары.Номенклатура
	|			И ПодтвержденныеОбъемыЗакупокОбороты.ЦФО = ВТТовары.ЦФО
	|ГДЕ
	|	ПодтвержденныеОбъемыЗакупокОбороты.Регистратор <> &ДокументРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодтвержденныеОбъемыЗакупокОбороты.ЦФО,
	|	ПодтвержденныеОбъемыЗакупокОбороты.Номенклатура,
	|	ПодтвержденныеОбъемыЗакупокОбороты.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВТТовары.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА ПодтвержденныеОбъемыЗакупокОбороты.ПериодКвартал
	|		КОГДА ВТТовары.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА ПодтвержденныеОбъемыЗакупокОбороты.ПериодГод
	|		ИНАЧЕ ПодтвержденныеОбъемыЗакупокОбороты.ПериодМесяц
	|	КОНЕЦ,
	|	ВТТовары.Периодичность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.КлючиКонтроляОбъемаЗакупок.ПустаяСсылка) КАК КлючКонтроля,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыКонтроляДокументов.КонтрольОбъемаЗакупок) КАК ВидКонтроля,
	|	ВТТовары.ЦФО КАК ЦФО,
	|	ВТТовары.Периодичность КАК Периодичность,
	|	ВТТовары.Период КАК Период,
	|	ВТТовары.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ВТТовары.Период КАК ПериодПодтверждения,
	|	ВТТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТТовары.Коэффициент КАК Коэффициент,
	|	ВТТовары.ДатаПоставки КАК ДатаПоставки,
	|	0 КАК Зарезервировано,
	|	ЕСТЬNULL(ВТОбороты.Подтверждено, 0) КАК Лимит,
	|	ВТТовары.Количество КАК ЗаявленоИзменение,
	|	ЕСТЬNULL(ВТОбороты.Запланировано, 0) КАК Заявлено,
	|	0 КАК Исполнено,
	|	0 КАК ЛимитИзменение,
	|	0 КАК ЗарезервированоИзменение,
	|	0 КАК ИсполненоИзменение,
	|	ЕСТЬNULL(ВТОбороты.Подтверждено, 0) - ЕСТЬNULL(ВТОбороты.Запланировано, 0) - ВТТовары.Количество КАК ДоступноПослеОперации,
	|	ЛОЖЬ КАК КонтрольНарушен
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбороты КАК ВТОбороты
	|		ПО ВТТовары.Номенклатура = ВТОбороты.Номенклатура
	|			И ВТТовары.ЦФО = ВТОбороты.ЦФО
	|			И ВТТовары.Период = ВТОбороты.Период";
	
	Результат = Запрос.Выполнить();
	
	Данные = Результат.Выгрузить();
	
	Возврат Данные;
	
КонецФункции   

// Процедура выполняет контроль обработанных данных
Функция ВыполнитьКонтроль(ИнформацияДляКонтроля, ДанныеДляКонтроля) Экспорт
	
	КонтрольНарушен = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеДляКонтроля) Тогда
	
		Для Каждого Строка Из ДанныеДляКонтроля Цикл
			
			Доступно = Строка.ДоступноПослеОперации;
			
			Строка.КонтрольНарушен = Доступно < 0;
			КонтрольНарушен = КонтрольНарушен ИЛИ Строка.КонтрольНарушен;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КонтрольНарушен;
	
КонецФункции

// Функция возвращает Истина, если нарушение контроля должно приводить к блокированию проведения
Функция БлокироватьПроведение(КлючКонтроля) Экспорт
	
	РежимКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольОбъемаЗакупок, "РежимКонтроля");
	Возврат РежимКонтроля = Перечисления.РежимыКонтроляДокументов.Блокировать;
	
КонецФункции

// Процедура возвращает табличный документ с расшифровкой контроля документа
//
Функция СформироватьРасшифровкуКонтроля(Проверка, СтрокаКонтроль) Экспорт
	
	//Реквизиты 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаКонтроль.Документ, "ЦФО, Проект");
	РезультатКонтроля 	= ПолучитьИзВременногоХранилища(СтрокаКонтроль.АдресРезультата);
	ДанныеКонтроля 		= РезультатКонтроля.Скопировать();
	
	// КОНТРОЛЬ ЗАДОЛЖЕННОСТИ ПО ДОГОВОРУ
	ДанныеКонтроля.Колонки.Добавить("ПериодПредставление");

	Для Каждого СтрокаКонтроля Из ДанныеКонтроля Цикл
		Если СтрокаКонтроля.Периодичность = Перечисления.Периодичность.Год Тогда
		  	СтрокаКонтроля.ПериодПредставление = Формат(СтрокаКонтроля.ПериодПодтверждения, "Л=ru_RU; ДФ='yyyy ""г"".'")		
		ИначеЕсли СтрокаКонтроля.Периодичность = Перечисления.Периодичность.Квартал Тогда
		  	СтрокаКонтроля.ПериодПредставление = Формат(СтрокаКонтроля.ПериодПодтверждения, "Л=ru_RU; ДФ='q ""квартал"" гггг"" г.""'")		
		Иначе
		  	СтрокаКонтроля.ПериодПредставление = Формат(СтрокаКонтроля.ПериодПодтверждения, "Л=ru_RU; ДФ='ММММ  гггг"" г.""'")		
		КонецЕсли;
	КонецЦикла;
	
	Возврат СформироватьОтчетКонтрольОбъемаЗакупок(СтрокаКонтроль, ДанныеКонтроля);
	
КонецФункции     

// Процедура сохраняет данные для контроля в табличной части документа
//
// Параметры:
//  ДанныеДляКонтроля	- Таблица значений	- Результат контроля
//  РезультатыКонтроля	- ТабличнаяЧасть	- табличная часть РезультатыКонтроля проверяемого документа
//
Процедура СохранитьДанныеДляКонтроляВДокументе(ДанныеДляКонтроля, РезультатыКонтроля) Экспорт
	
	Инфо = РегистрыСведений.АналитикаКонтроляОбъемаЗакупок.ИнформацияОКлюче();
	ИменаПолей = КонтрольУХКлючи.ИменаПолейКоллекцииПоУмолчанию(Инфо);
	ИменаПолей.АналитикаКонтроляОбъемаЗакупок = "КлючКонтроля";
	
	//КонтрольУХКлючи.ЗаполнитьВКоллекции(Инфо, ДанныеДляКонтроля, ИменаПолей); 
	РегистрыСведений.АналитикаКонтроляОбъемаЗакупок.ЗаполнитьВКоллекции(ДанныеДляКонтроля, ИменаПолей);
	
	// Загрузить результат контроля в тч.РезультатыКонтроля
	Для Каждого Строка Из ДанныеДляКонтроля Цикл
		ЗаполнитьЗначенияСвойств(РезультатыКонтроля.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры // СохранитьДанныеДляКонтроляВДокументе()
	
// Функция возвращает соответствие с описанием колонок таблицы данных контроля, которые получаются из ключа контроля
//
// Возвращаемое значение:
//   Соответствие   - {ИмяКолонки, Структура("ИмяКолонки, ОписаниеТипа, ПутьКДанным")}
//
Функция КолонкиДанныхКонтроля() Экспорт
	
	Колонки = Новый Соответствие;
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ЦФО",
		Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Номенклатура",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ТоварнаяКатегория",
		Новый ОписаниеТипов("СправочникСсылка.КатегорииЗакупок"), "Номенклатура.КатегорияЗакупок");  	
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"ПериодПодтверждения",
		Новый ОписаниеТипов("Дата"));   

	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Периодичность",
		Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
			
	Результат = Новый Структура;
	Результат.Вставить("Источник", 	"Справочник.КлючиКонтроляОбъемаЗакупок");
	Результат.Вставить("Колонки", 	Колонки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтчетКонтрольОбъемаЗакупок(СтрокаКонтроль, ДанныеКонтроля) экспорт
	
	ТабДок 	= Новый ТабличныйДокумент;
	Макет 	= ПланыВидовХарактеристик.ВидыКонтроляДокументов.ПолучитьМакет("КонтрольОбъемаЗакупок");

	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
	Если НЕ ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда	
		ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	Иначе                                                            
		ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицыЕХ"); 
	КонецЕсли;
	ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Документ = СтрокаКонтроль.Документ;
	
	ОбластьЗаголовок.Параметры.ДатаВремяКонтроля 	= СтрокаКонтроль.ВремяПроверки;
	ОбластьЗаголовок.Параметры.ТекущееВремя 		= ТекущаяДатаСеанса();
	ОбластьЗаголовок.Параметры.ТекущийПользователь 	= Пользователи.ТекущийПользователь();
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);

	//
	ТабДок.НачатьАвтогруппировкуСтрок();
	Для каждого Данные Из ДанныеКонтроля Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(Данные);
		ОбластьДетальныхЗаписей.Параметры.ДоступноПослеОперации = 
			Данные.Лимит + Данные.ЛимитИзменение
			- Данные.Исполнено - Данные.ИсполненоИзменение
			- Данные.Зарезервировано - Данные.ЗарезервированоИзменение 
			- Данные.Заявлено - Данные.ЗаявленоИзменение;  
		ОбластьДетальныхЗаписей.Параметры.Доступно = 	Данные.Лимит - Данные.Заявлено;	
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла; 
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	//
	ДанныеКонтроля.Свернуть("", "Лимит, Исполнено, Зарезервировано, Заявлено, ЛимитИзменение, ИсполненоИзменение, ЗарезервированоИзменение, ЗаявленоИзменение");
	Если ДанныеКонтроля.Количество()>0 Тогда
		Данные = ДанныеКонтроля[0];
		ОбластьПодвалТаблицы.Параметры.Заполнить(Данные);
		ОбластьПодвалТаблицы.Параметры.ДоступноПослеОперации = 
			Данные.Лимит + Данные.ЛимитИзменение
			- Данные.Исполнено - Данные.ИсполненоИзменение
			- Данные.Зарезервировано - Данные.ЗарезервированоИзменение 
			- Данные.Заявлено - Данные.ЗаявленоИзменение;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти
